from django.core.management import BaseCommand
from lib.agent.accounts import default_account as account
from agent.models import FileBsis


class CreateFileBsis(BaseCommand):
    help = 'Create FileBsis Task'

    def add_arguments(self, parser):
        parser.add_argument("name", type=str, nargs='?', default=account.name, help="name")
        parser.add_argument("credit_id", type=str, nargs='?', default=account.credit_id, help="credit id")
        parser.add_argument("user_id", type=str, nargs='?', default=account.user_id, help="user id or phone")
        parser.add_argument("password", type=str, nargs='?', default=account.password, help="user password")

    def handle(self, *args, **options):
        data1 = [
            ['资产', '行次', '期末余额', '上年年末余额', '负债和所有者（或股东）权益', '行次', '期末余额', '上年年末余额'],
            ['流动资产：', '0', '', '', '流动负债：', '0', '', ''],
            ['货币资金', '1', '543757.69', '1937984.31', '短期借款', '31', '', ''],
            ['短期投资', '2', '', '', '应付票据', '32', '', ''],
            ['应收票据', '3', '', '', '应付账款', '33', '1429660.41', '1434660.41'],
            ['应收账款', '4', '315818.21', '240874.21', '预收账款', '34', '', ''],
            ['预付账款', '5', '', '', '应付职工薪酬', '35', '', ''],
            ['应收股利', '6', '', '', '应交税费', '36', '-3961.50', '-4205.88'],
            ['应收利息', '7', '', '', '应付利息', '37', '', ''],
            ['其他应收款', '8', '270322.83', '-428178.22', '应付利润', '38', '', ''],
            ['存货', '9', '', '', '其他应付款', '39', '5534310.31', '5955805.12'],
            ['其中：原材料', '10', '', '', '其他流动负债', '40', '', ''],
            ['在产品', '11', '', '', '流动负债合计：', '41', '6960009.22', '7386259.65'],
            ['库存商品', '12', '', '', '非流动负债：', '0', '', ''],
            ['周转材料', '13', '', '', '长期借款', '42', '', ''],
            ['其他流动资产', '14', '', '', '长期应付款', '43', '', ''],
            ['流动资产合计', '15', '1129898.73', '1750680.30', '递延收益', '44', '', ''],
            ['非流动资产：', '0', '', '', '其他非流动负债', '45', '', ''],
            ['长期债券投资', '16', '', '', '非流动负债合计', '46', '', ''],
            ['长期股权投资', '17', '', '', '负债合计', '47', '6960009.22', '7386259.65'],
            ['固定资产原价', '18', '560408.99', '560408.99', '', '', '', ''],
            ['减：累计折旧', '19', '560408.99', '560408.99', '', '', '', ''],
            ['固定资产账面价值', '20', '', '', '', '', '', ''],
            ['在建工程', '21', '', '', '', '', '', ''],
            ['工程物资', '22', '', '', '', '', '', ''],
            ['固定资产清理', '23', '', '', '', '', '', ''],
            ['生产性生物资产', '24', '', '', '所有者权益（或股东权益）：', '0', '', ''],
            ['无形资产', '25', '', '', '实收资本（或股本）', '48', '', ''],
            ['开发支出', '26', '', '', '资本公积', '49', '', ''],
            ['长期待摊费用', '27', '', '', '盈余公积', '50', '', ''],
            ['其他非流动资产', '28', '', '', '未分配利润', '51', '-5830110.49', '-5635579.35'],
            ['非流动资产合计', '29', '', '', '所有者权益（或股东权益）合计', '52', '-5830110.49', '-5635579.35'],
            ['资产总额', '30', '1129898.73', '1750680.30', '负债和所有者权益（或股东权益）总计', '53', '1129898.73', '1750680.30'],
        ]

        data2 = [
            ['项目', '行次', '上期金额', '本期金额'],
            ['一、营业收入', '1', '4664.15', '4664.15'],
            ['减：营业成本', '2', '', ''],
            ['税金及附加', '3', '', ''],
            ['其中：消费税', '4', '', ''],
            ['营业税', '5', '', ''],
            ['城市维护建设税', '6', '', ''],
            ['资源税', '7', '', ''],
            ['土地增值税', '8', '', ''],
            ['城镇土地使用税、房产税、车船税、印花税', '9', '', ''],
            ['教育费附加、矿产资源补偿税、排污费', '10', '', ''],
            ['销售费用', '11', '', ''],
            ['其中：商品维修费', '12', '', ''],
            ['广告费和业务宣传费', '13', '', ''],
            ['管理费用', '14', '198893.12', '95852.19'],
            ['其中：开办费', '15', '', ''],
            ['业务招待费', '16', '', ''],
            ['研究费用', '17', '', ''],
            ['财务费用', '18', '302.17', '198.94'],
            ['其中：利息费用（收入以“-”号填列）', '19', '', ''],
            ['加：投资收益（损失以“-”号填列）', '20', '', ''],
            ['二、营业利润（亏损以“-”号填列）', '21', '-194531.14', '-91386.98'],
            ['加：营业外收入', '22', '', ''],
            ['其中：政府补助', '23', '', ''],
            ['减：营业外支出', '24', '', ''],
            ['其中：坏账损失', '25', '', ''],
            ['无法收回的长期债券投资损失', '26', '', ''],
            ['无法收回的长期股权投资损失', '27', '', ''],
            ['自然灾害等不可抗力因素造成的损失', '28', '', ''],
            ['税收滞纳金', '29', '', ''],
            ['三、利润总额（亏损总额以“-”号填列）', '30', '-194531.14', '-91386.98'],
            ['减：所得税费用', '31', '', ''],
            ['四：净利润（净亏损以“-”号填列）', '32', '-194531.14', '-91386.98'],
        ]

        sheet_data = {
            "资产负债表": data1,
            "利润表": data2,
        }

        FileBsis.objects.create(
            name=options['name'],
            credit_id=options['credit_id'],
            user_id=options['user_id'],
            password=options['password'],
            sheet_data=sheet_data,
        )
